[
{"recommendedInd": ["Recommended"], "helpfulCount": ["198"], "funnyCount": ["6"], "hoursPlayed": ["1,384.5"], "postedDate": ["Posted: December 17, 2018"], "content": "Kingdom Come: Deliverance is a brilliantly atmospherical historical RPG without any fantasy whatsoever, featuring extremely deadly combat, great historical accuracy, absolutely stunning visuals and a living breathing world to become the greatest Henry of them all. Your fame will increase to the point that literally any and all residents of the entire game world will know who you are. (As a matter of fact, they won't stop greeting you or commenting on your presence if you just as much as get 15 paces close to them, which is probably the singlemost annoying thing about the entire game.)\nMechanically, the combat system of Kingdom Come is pure genius. It feels like Mount&Blade in parts, but is so much more deadly and it actually feels absolutely amazing to fight against more than two opponents simultaneously and not die 9 out of 10 times.\nThe only downside is that the game, while visually very appealing, is not quite an AAA game, therefore it has bugs here and there and immersion breaking animations which at times are mighty wonky. Won't change the fact that I had more fun with this than with Witcher 3 though. And I had lots and lots of amazing fun with Witcher 3.\nThere are countless side quests, very likeable (and a lot more cloned) NPCs and a quite fleshed out reputation system which changes NPC reactions locally or personally without instantly affecting the opposite end of the world.\nAs an RPG, it isn't really that epic storywise, but it is the best medieval sandbox I have ever stumbled upon and proceeded to lose myself in since I became a cult follower of Mount&Blade."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["426"], "funnyCount": ["14"], "hoursPlayed": ["63.5"], "postedDate": ["Posted: February 18, 2018"], "content": "This game gives me the same feeling i had when i first played Oblivion."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["162"], "funnyCount": ["14"], "hoursPlayed": ["67.0"], "postedDate": ["Posted: June 29, 2018"], "content": "This is a game that is not for everyone, but for the niche and nerdy few that it's for, it's the only game.\nMuch like ARMA3 for fans of realistic military conflict, Kingdom Come is a game well known for some janki moments, awkward quirks, and cult appeal now. \nIt's one of the most unstable and uncomfortable games to play at times, but it's the only game that lets you do and experience this kind of thing.\nDo not expect combat to be Skyrim with For Honor angles of striking. Did you rouse the ire of 8 heavily armed people at once? You're eight different ways of ♥♥♥♥ed. Either be quick to drop the weak ones and run, be accurate to drill some arrows into them and run, or run.\nThis is not your power fantasy, this is history in all it's authenticity and cruelty. Swords are dangerous.\nEvery single step without falling, swing of a sword that connects, success at bartering and every single other thing you do without messing up, is a step that is -earned-. This game gives you absolutely nothing but the clothes on your back and a sub par shortsword. By the time the first few hours are up those clothes will be torn and your sword is pathetic. \nBut through it's brutality and complicated or confusing systems and moments, you will feel at one with the world. This is the kind of game that if you walk around at night in real life, you might think you're in trouble for not holding a torch, because it's illegal to walk in town at night without a light in Rattay. It's immersion is second to none, for every great moment and brutally frustrating prediciament's worth. \nDid Skyrim get too repetitive and safe? Finish the Witcher and want that same draw inside of a beautiful world with entertaining conversaion? Tired of having your hand held?\nPlay Kingdom Come: Deliverence. \nLike your dad drinks whiskey with a single sphere of ice while you sip a beer.\nYou will play Kingdom Come, while the less acquainted play Skyrim.\nIt's a game that does not need dragons, magic, or tacked on tropes of the modern RPG to stand out."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["1,306"], "funnyCount": ["1,698"], "hoursPlayed": ["48.2"], "postedDate": ["Posted: February 17, 2018"], "content": "Spoiler mate:\nI fight a priest in the church.\nI beat the priest.\nThe priest and I go drinking.\nWe get drunk.\nWe have a night of debauchery.\nThe priest and I get lucky with two girls in the same barn.\nWe wake up drunk and go to church.\nI give a sermon while drunk.\nThe town agrees with what I say.\nThe priest and I are now friends."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["70"], "funnyCount": ["11"], "hoursPlayed": ["82.4"], "postedDate": ["Posted: December 2, 2018"], "content": "The best heckin' peasant simulator you'll ever play. \n(Full Disclosure: I played this game about 10 months after release, and after Warhorse had patched and fixed many of the known bugs/issues.)\nThis is literally everything I could have asked for from a medieval RPG. It has a beautiful, gritty realism, and the sheer level of technical ambition expressed by such a small studio with limited funding is impressive in it's own right. \nIt breaks and remakes nearly every conventional RPG rule, and it's a bit of a system shock at first; grappling with the fact the player character is a dirty, moronic peasant who sucks at everything in a world that's more than happy to kill him as an disinterested afterthought. Once it finally clicks that you're not playing \"The Chosen One,\" but some mud-covered chump in the backwoods of 15th century Bohemia, it makes for a surprisingly delightful experience.  The first third of the game is spent desperately scrabbling around, trying not to be killed by characters richer, stronger, or faster than you, and with a limited (albeit less draconian than it was at launch) save system, you have to seriously consider some of the decisions you make. \nBut the pay-off? Absurdly gratifying. Your character, Henry, goes from someone who's royally screwed if two drunken farmers attack him on the road, to someone who is able to tackle four or five well-armed soldiers and win... and you absolutely earn it. \nThe Pros:\n- The Visuals: the countryside is rich, lush and gorgeous, and the forest feels straight-up alive. The colors are bright, the armor and clothes range from shiny and resplendent, to covered with mud like half of the populace, and it's all fantastic.\n- The Storyline(s): The main quest and the side-quests are surprisingly well-written, interesting, and a lot fo them are just downright fun. Whether it's chunking poop at somebody's house, getting drunk with a priest, starting an exhibition fight, rooting out heresy, stealing horses, or just chasing down bounties, every single one is a little bit different and astonishingly involved and fleshed-out. \n- The Combat system: Directionally-based melee combat with a heavy emphasis on the player actually learning moves and combos (that they have to perfectly execute each time they want to do them) was both challenging and refreshing. Attacks are easily interupted. Blocking takes stamina. Swords spank and scrape across armor instead of automatically dealing damage. Fighting a single person is almost a strategic dance. Fighting a group of people is a terrifying scum. It's not easy. Sometimes it's stupidly tricky. But that's also the point, and evolving from a peasant who can barely swing a sword to a man-at-arms who's taking names and kicking ♥♥♥ is a skill journey that's really rewarding.\n- The Skill system: Want to heal stuff? Can't. Because you're stupid and don't know how. Want to learn? Can't. Because you're a filthy peasant who can't read. Want to learn to read? Better collect some money and spare time. Want to get stronger and faster? Better run, jump, and train like your life depends on it. Because it does. \nThe Cons:\n- The Visuals: Some of the most beautiful graphics clash with some oddly low-res textures, and there is a decent amount of armor clipping and pop-in. Additionally, a lot of face-models are re-used, and you start to notice. \n- Archery: Maddening to learn, nearly impossible to perfect at long range, and potentially cheesy at close range. The infallible accuracy displayed by NPCs in return is also a little annoying. Realism and immersion? Possibly. Still frustrating. \n- The bugs: The simple fact of the matter is that there were a lot of bugs. Occasionally characters get stuck in a position, things may be slow to render, and sometimes a perfect storm of small things can make the game crash an inopportune moments. You start to get to a point, far enough in the game, where it feels less stable. \nTHAT SAID: There WERE a lot of bugs. There are fewer bugs now than there were nine months ago. And Warhorse has actually been very good about trying to fix and patch bugs, and tweak elements of the game to meet player demands. They overhauled the save system, sleep system, and lockpicking system thanks to feedback.\nAt the end of the day, it's FAR less buggy than literally ANY Bethesda title has been at launch, and Warhorse had about the tenth of and Elder Scrolls game budget to work with. More importantly, while a number of big, triple-A publishers are more than content to let bugs and bad features exist forever, they've been pretty proactive with making things right, and considering the impressive level of ambition they had with this game, it's fantastic. \nLong story short: This is an indie game that plays as well as anything from a major company, and aspires to be more involved and intricate than nearly any other open-world RPG I've played. Bold, ambitious, and beautiful, it is absolutely worth the time and money."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["200"], "funnyCount": ["22"], "hoursPlayed": ["60.8"], "postedDate": ["Posted: May 16, 2018"], "content": "There seem to be a lot of people having all kinds of technical problems with this game.\nI, however, am not one of them except for a couple of times my character got stuck.\nI'm a Kickstarter backer from day 1. The things they promised got me excited. Dropped some extra bucks so I could get beta access.  \nBeta access didnt do me good. It looked like crap, played like crap, kingdom crap. Money wasted I figured.  \nWhen the game got released on Steam much of my enthousiasm was killed by the beta. So it took some time before I gave it a go.\nMy first couple of sessions I wasnt sure what to think. It looked and played a bit rough, and my character got killed easily so exploring (which I love to do in rpg's)  was a stupid thing to do.\nOn my 3rd session I started to enjoy the game. Did mostly follow the main story, practiced fighting skills and did some thieving.  \nThe thing is, practice makes perfect. You use a mace a lot? You get better stats, slowly. You decide you want to switch to a sword? Tough luck, you have to start practicing again. Reading? First go to a scribe who teaches you. Then, everytime you go to bed take some hours to read a book. It sounds all logical but I havent played a single rpg where you needed to invest so much time and thoughts into \"levelling\". You really have to work on your skills. \nSo here's my list of good and bad in this game:\nGood\n- Nice story. Have to say its been done before like a thousand times: Start as a nobody, end like ... eh... lets not spoil that. \n- Fighting is fun and rewarding (yet frustrating in the beginning)\n- Because of the first 2 points, it was highly addicitive.\n- Multiple ways of tackling a problem or completing a quest. Really well done!\n- Mature content. \n- Realistic scenery.\n- Realistic day pattern. You'll get hungry, you need sleep. It wasnt even annoying. \n- Fast travelling.\n- Funny at times.\n- Voice acting and music. \n- Game ran smooth on my 970gtx / 16g ram. Graphic settings at high. \n- Mods\nMediocre\n- Sidequests. There arent a lot of them. Some are great, some are crap. I dont like fetch/hunting quests. And many of them are unrewarding. \n- Loot. Its basically much of the same. And when you already have 10k in money you'll mostly leave it untouched. Same goes for treasures: handy at the first part of the game, after that its pretty useless. \n- Character animations in conversations. They are bad, but the funny kind of bad. It kinda kills the mood though. \n- Towns feel a bit empty. NPC's giving the same responses when u talk to them.  \n- Game ends suddenly. Lets just say there will come a sequel, the story aint finished.\n- Graphics. Its all mediocre. I noticed a lot of popups: trees, npc's clothing, buildings. Like I mentioned before, its a bit rough.\n- No replay value imo. The main story is quite linear. \n(EDIT) It might be interesting to try tackling quests in a different way on a 2nd run.\nBad\n- The save system. I'm glad they implemented the \"save and exit\" option at some point. Its a hardcore system, make mistakes and get punished by replaying a whole hour. \nAnd then make the same mistake again! (Like thinking next run youre able to kill that pack of bandits). Not what I enjoy. I started using the \"always save mod\" around 2/3 into the game and it made the overall experience a lot better.\n- One part of the main story. The Monastery quest... When you get there make sure you'll have something to keep you awake.\n- I dont consider myself an idiot, but quite some part of the game I was running around with a nice longsword I found and a shield wondering why the hell I couldnt produce the combos I learned. The interwebs told me eventually you couldnt do combos when you carried a longsword and a shield. Makes sense, but I would have loved a warning from the game. \n- Just 1 bossfight. A pity.\n- Promised massive battles lack massiveness.  \nFunny bugs I encountered:\n- Early in the game Lord Divish's clothes failed to load. It resulted in him walking around the castle butt naked. I regret I didnt make a screenshot but I was busy cleaning my keyboard and monitor from the beer that ended on it. \n- Main character Henry taking a bath while wearing his full plate armour. (check my screenshots)  \nThis game is far from perfect. I enjoyed it a lot nevertheless.\nWIll update when I finished some dlc."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["94"], "funnyCount": ["7"], "hoursPlayed": ["260.2"], "postedDate": ["Posted: June 4, 2018"], "content": "A very late thumbs up review, and the reason why. \nWhen I first played this game I fell a little in love with it, the story drew me in and I was a fan of most of the characters, I didn't quite know what I wanted to be so I became a master of everything with no real set morals, a sort of really heavily armed and armoured thief/knight/archer - but I had fun. \nI wanted to replay it and try to be a pure Thief, light armour, short sword, bow stealth kills and poising ect, but after beating it the first time i found it somewhat hard to go back to the beginning and found myself shelving it for awhile. Now that I have come back to it months later I've found I am a little less in love with the game and its flaws are starting to shine through a bit. \nHere is what I like: \n-A good story the first time in. \n-Quality voice acting. \n-Good combat. \n-Diverse equipment and skill sets. \n-People react to how dirty / bloody ect you are and you'll need a bath on occassion, you also need to maintain your gear. \n-Real world day night cycle that people follow in towns - Guards expect you to carry a torch at night, people have houses and sleep, ect. \n-You have to eat! \n-You need a bed to sleep in to save unless you have a potion ( some people hate the save system but i really liked that it forced you to live with consequences ) \n-You need to learn skills: Sword play, archery, horseriding, how to read, ect -- I thought this was a nice change of pace from the standard village farmer turns warrior overnight. \nAnd now for the flaws: \n-The game allows you to Romance certain characters - But once you have they revert back to 'default person X', while i'm not saying I want to RPG out a marraige it would be nice to see /some/ effect to going on dates, courting, doing the dirty other than just suddenly going full circle to being a no one to them. Even late 90's games like Baldurs Gate had this one figured out. In Kingdom come romance is basically a quest, complete steps, see boobs, quest over no one cares nothing changes. \n- If you choose to be a Thief, its very easy to get rich, in Kingdom come crime pays, especially murder, so long as you don't get caught which is easy enough to avoid. \n- No matter how rich you become you can never buy anything of consequence, you can have tens of thousands in silver coins ( thankfully the only item in game with no weight ) and it doesn't matter because you've already purchased the best arms, armour, horse, ect - But you'll never have land, or a shop or a home. \n- Quests come in two flavours, very easy, or rediculously hard. An example of this would be the Thief quest line, I started a new game, with a new character, unskilled in every way and completed with ease every single quest until I got to the last one where you 100% have to pick a \"very hard lock\" - This means skill level 15 ( 10 with a potion ) soooo It's off to grind every lock in the land until I \"can\" complete the quest, because you simply don't get an option. \n- On the topic of locks, for a game that strived ( and marketed itself ) as being realistic as possible, I can not fathom why no one thought of a 'force lock' alternative to lock picking, when you fail to pick a lock it makes a 'loud noise that can alert people' so the mechanic for forcing a lock open seems to already be there, save for the ability to do it. \nAn example that comes to mind is an early quest to take out a bandit camp, none of the bodies has a key, there is a chest with a very hard lock, you're not going to be able to open it, but why not simply smash the lock off with say, the giant mace i am weilding? Am I supposed to be concerned it may altert the people laying around the chest that i just killed? \nI digress... \nHere is why it is a thumbs up: You will really enjoy your first time playing this game, you will be drawn in for the most part and enjoy a solid 70 - 100 hours of RPG time. Is 70+ hours of entertainment worth the price to buy for you? That is your call. I'm glad I bought the game, and i find myself a little frustrated with the flaws i overlooked my first time around. But nothing is perfect, so Kingdom Come is a least a solid \"good\""},
{"recommendedInd": ["Recommended"], "helpfulCount": ["38"], "funnyCount": ["3"], "hoursPlayed": ["100.1"], "postedDate": ["Posted: April 10"], "content": "Well, after played this game more than 40 hours i decide to write my review. So far i wanted to love this game somehow, but this game had a lot full of bug which that destroying my experience while in game. \nAnd here is my review so far :\n+ The graphic are very beautiful (I cant even tell what is the difference between low and ultra setting, those setting seems pretty similar for me) \n+ The combat system is bit complicate but you gonna love it when you master it!\n+ Realism mode make this game more challanges! (like your character who can be tired, hungry, and can even get dirty if you haven't bathed.)\n+ Realistic weapons and armory in medieval era, look so cool and realistic!\n+ Many activities can be done! (Hunting, Pickpocketing, Stealing, and even duel)\n+ (An optional) You will able to switch your voice language with English subtitle (Imo better to play this game with Deutch audio voice)\n* (An optional) Steam Controller is the best for playing this game\n- The graphical issue seems not fix yet (Sometimes the shadow is glitches, and missing texture)\n- Dubbing voice not synchronized properly\n- Perfomance issue (Random stuttering and random fps drop wasnt fix yet)\n- Saving system suck ( you i'll need to buy a \"schnapps\" from local trader to saving your game in any moment which is not very cheap)\n- Bowing suck (....or it just me)\n- The AI are terribly stupid......yes they are!\n- Combat mode is buggy as hell! (Like seriously! Escaping from my enemy about 2km even the enemy was not there anymore, and the combat mode was still on.....i cant even use fast travel location, or saving)\nThis game has been out for a year now, and until now there are still many bugs that they haven't fixed. And keep in mind this game has a lot of potential but only needs more attention to its development. Even so until now I will still continue playing this game because the story that is owned is quite interesting. But it would be nice to buy this game while its discount.\n7/10 \"Press X button to haggle this review score!"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["458"], "funnyCount": ["13"], "hoursPlayed": ["23.8"], "postedDate": ["Posted: February 14, 2018"], "content": "Gone are the times when a game can try and do something different and not get swamped by people complaining about it. \nHeres why you should give Kingdom Come a shot: \nIts a game that tries new things apart from the typical RPG model. Things are actually difficult in Kingdom Come. The save system is a new and novel idea, and it prevents you from savescumming your way through the game with ease. Making money is actually decently difficult in the early game, and you can expect the feeling that youre actually rising from dirt to glory. It is very evident in the game that, unlike other RPGs, you cant solve everything by fighting. You will come across fights that you wont win. \nIts not a game for the gamer who doesnt want to, well, role play. Its not for someone who is going to skip through the cut scenes and wants to get right to the action. What it does exceedingly well though is realism; no save scumming, you have to eat, you have to sleep, you have to bathe. \nTl;dr: If you want a game that tries novel things and where NPCs will call your bull**** and try to kill you,  give it a go.\nPS- If the save system really does break it for you, the devs announced day one that, due to concerns from many players, they are looking into a save and quit feature. In other words, the devs are great and you can expect that theyll listen to the community and try and fix the issues many casual players have."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["272"], "funnyCount": ["8"], "hoursPlayed": ["261.7"], "postedDate": ["Posted: March 3, 2018"], "content": "As a person who \n on real texts in old German and old French etc. \nHere are just some examples I really liked them put in:\nAbout Cons:"}
][
{"recommendedInd": ["Recommended"], "helpfulCount": ["7"], "funnyCount": ["1"], "hoursPlayed": ["6.9"], "postedDate": ["Posted: June 11"], "content": "hard for the first hour, then its just muscle memory.\nGood game all in all, time for new babe+ ;)"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["17"], "funnyCount": ["5"], "hoursPlayed": ["0.9"], "postedDate": ["Posted: May 8"], "content": "Overpriced but GG"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["5"], "hoursPlayed": ["9.5"], "postedDate": ["Posted: May 8"], "content": "Awesome game, BUY IT!"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["5"], "funnyCount": ["1"], "hoursPlayed": ["2.4"], "postedDate": ["Posted: May 3"], "content": "Insane game, buy it"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["3"], "funnyCount": ["1"], "hoursPlayed": ["6.1"], "postedDate": ["Posted: July 7"], "content": "During my time with the game, I've come to realize the challenge is mostly odds. The game wins not by throwing a few very difficult problems at you, but by throwing thousands and thousands of very small problems at you. The thing is, failing ANY of them typically results in a catastrophic setback, starting pretty early on at the drain. There are some areas where failure isn't too big a deal- You'll go down maybe one screen. But there are some jumps specifically designed so that if you fail them, you will drop *multiple zones*. Screw up in the Frontier? Fall through whatever you've done in the frontier, fall through Bargainburg, fall into the bottom of False King's Keep. Thats about 10 screens. As you get higher, these become more common, with harder jumps that punish you tremendously for a single failure. Then, when you hit one of these and ♥♥♥♥ it up, and go down several screens, it tilts you, and typically, it drops you at another screen designed to heavily punish failing (Bargainburg roof jump fail drops you to false king rain jump; Rain jump fail drops you to drain cage jump; cage jump fail drops you to the top of the first zone). So now, you're trying to do these difficult, stressful, high-risk jumps while tilted, fail them because you're tilted, and tilt even harder, resulting in a cascade failure where you go from the frontier to the forest in just a three bad jumps. It got to the point where finding a new challenge was 1% of the game, and just trying to get back where I was because I made one mistake became 99%. So you can be good at the game; You can even be extremely good at the game. Its not good enough. What you need to be is perfect. I play games to de-stress, not get more. I'll leave this review as positive because the game is not bad; Its just not for me."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["3"], "hoursPlayed": ["3.9"], "postedDate": ["Posted: May 10"], "content": "I've always had a fascination of height and towers, even chasms like in Made In Abyss. So as soon as I saw this game I was hooked. I love pixel art and the challenge aspect with the big implication of messing up a single jump. It really made me anxious a lot of times and made my hands all sweaty. Reaching the top makes you feel like a king!\nMy only gripe with the game is the comical approach of \"There is a Smoking Hot Babe at the Top!\". I'd rather have a more serious and mysterious tone instead. Not knowing exactly what awaits you would have made for a more interesting climb. But this is just my opinion. I still love the game! Not recommended for people who wants the game to hold their hand."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["6"], "funnyCount": ["14"], "hoursPlayed": ["10.4"], "postedDate": ["Posted: May 14"], "content": "♥♥♥♥ this piece of ♥♥♥♥ing donkey ♥♥♥ of a game. Still enjoyed it though 10/10"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["9"], "funnyCount": ["9"], "hoursPlayed": ["8.6"], "postedDate": ["Posted: June 3"], "content": ""},
{"recommendedInd": ["Recommended"], "helpfulCount": ["4"], "hoursPlayed": ["1.9"], "postedDate": ["Posted: May 3"], "content": "Fun game so far, quite difficult. Decent amount of replaying the same areas when you inevitably fall, but once you learn the strategy for each area you can get through pretty quickly.\nThere's a bit of a learning curve to the controls, but once you get used to them it's really satisfying to maneuver through levels."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["5"], "funnyCount": ["3"], "hoursPlayed": ["7.9"], "postedDate": ["Posted: August 6"], "content": "thanks, i F***ING hate it (sorry)\nEdit 1: F*** THIS GAME 10/10"}
][
{"recommendedInd": ["Recommended"], "helpfulCount": ["7"], "funnyCount": ["1"], "hoursPlayed": ["6.9"], "postedDate": ["Posted: June 11"], "content": "hard for the first hour, then its just muscle memory.\nGood game all in all, time for new babe+ ;)"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["17"], "funnyCount": ["5"], "hoursPlayed": ["0.9"], "postedDate": ["Posted: May 8"], "content": "Overpriced but GG"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["5"], "hoursPlayed": ["9.5"], "postedDate": ["Posted: May 8"], "content": "Awesome game, BUY IT!"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["5"], "funnyCount": ["1"], "hoursPlayed": ["2.4"], "postedDate": ["Posted: May 3"], "content": "Insane game, buy it"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["3"], "funnyCount": ["1"], "hoursPlayed": ["6.1"], "postedDate": ["Posted: July 7"], "content": "During my time with the game, I've come to realize the challenge is mostly odds. The game wins not by throwing a few very difficult problems at you, but by throwing thousands and thousands of very small problems at you. The thing is, failing ANY of them typically results in a catastrophic setback, starting pretty early on at the drain. There are some areas where failure isn't too big a deal- You'll go down maybe one screen. But there are some jumps specifically designed so that if you fail them, you will drop *multiple zones*. Screw up in the Frontier? Fall through whatever you've done in the frontier, fall through Bargainburg, fall into the bottom of False King's Keep. Thats about 10 screens. As you get higher, these become more common, with harder jumps that punish you tremendously for a single failure. Then, when you hit one of these and ♥♥♥♥ it up, and go down several screens, it tilts you, and typically, it drops you at another screen designed to heavily punish failing (Bargainburg roof jump fail drops you to false king rain jump; Rain jump fail drops you to drain cage jump; cage jump fail drops you to the top of the first zone). So now, you're trying to do these difficult, stressful, high-risk jumps while tilted, fail them because you're tilted, and tilt even harder, resulting in a cascade failure where you go from the frontier to the forest in just a three bad jumps. It got to the point where finding a new challenge was 1% of the game, and just trying to get back where I was because I made one mistake became 99%. So you can be good at the game; You can even be extremely good at the game. Its not good enough. What you need to be is perfect. I play games to de-stress, not get more. I'll leave this review as positive because the game is not bad; Its just not for me."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["3"], "hoursPlayed": ["3.9"], "postedDate": ["Posted: May 10"], "content": "I've always had a fascination of height and towers, even chasms like in Made In Abyss. So as soon as I saw this game I was hooked. I love pixel art and the challenge aspect with the big implication of messing up a single jump. It really made me anxious a lot of times and made my hands all sweaty. Reaching the top makes you feel like a king!\nMy only gripe with the game is the comical approach of \"There is a Smoking Hot Babe at the Top!\". I'd rather have a more serious and mysterious tone instead. Not knowing exactly what awaits you would have made for a more interesting climb. But this is just my opinion. I still love the game! Not recommended for people who wants the game to hold their hand."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["6"], "funnyCount": ["14"], "hoursPlayed": ["10.4"], "postedDate": ["Posted: May 14"], "content": "♥♥♥♥ this piece of ♥♥♥♥ing donkey ♥♥♥ of a game. Still enjoyed it though 10/10"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["9"], "funnyCount": ["9"], "hoursPlayed": ["8.6"], "postedDate": ["Posted: June 3"], "content": ""},
{"recommendedInd": ["Recommended"], "helpfulCount": ["4"], "hoursPlayed": ["1.9"], "postedDate": ["Posted: May 3"], "content": "Fun game so far, quite difficult. Decent amount of replaying the same areas when you inevitably fall, but once you learn the strategy for each area you can get through pretty quickly.\nThere's a bit of a learning curve to the controls, but once you get used to them it's really satisfying to maneuver through levels."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["5"], "funnyCount": ["3"], "hoursPlayed": ["7.9"], "postedDate": ["Posted: August 6"], "content": "thanks, i F***ING hate it (sorry)\nEdit 1: F*** THIS GAME 10/10"}
][
{"recommendedInd": ["Recommended"], "helpfulCount": ["485"], "funnyCount": ["33"], "postedDate": ["Posted: March 30, 2018"], "content": "1-Click \"Download\", game will open;\n2-After the loading screens, close the game;\n3-On Steam Client go to Library>Games;\n4-Right click on KC:D, select \"View Downloadable Content\";\n5-On the small new window, uncheck the square box and check it again;\n6-Steam will automagically download this DLC;\n7-Kill the cumans while whispering in their ears."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["659"], "funnyCount": ["20"], "postedDate": ["Posted: November 10, 2017"], "content": "If you've finished the game, I don't need to tell you these guys deserve money, In a world where AAA games are clawing as hard and as desperately as they've ever have to get your money, these angelic saints, who we lowly mortals are not worthy to walk the same earth, yet they release a fantastic game on a design and experience level that is far above and beyond the triple A games. they give you it for FREE. They just want their story to be told and they gave us it for free. I am going to find a donation method to these guys and pay the balance to equal £40 full price. \nand if the devs ever see this, I love you deeply. I am learning programming and games development and I was one step away from giving up and trying something else, then I played this game, that you gave away for free. You let me find that fire again. I am going to stick with this and make you proud. Thank you."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["1,008"], "funnyCount": ["7"], "postedDate": ["Posted: March 29, 2018"], "content": "For anyone who are unable to download the HD texture (after you click the 'download' button, oddly it starts the game without any download notification, and I still cant enable the HD texture from the menu - it says HD texture DLC is required), here's what you need to do:\n1. click the 'download' button. it will start up the game. \n2. quit the game. \n3. close steam app.\n4. restart steam app.\n5. in your library menu in your steam app, look for \"Kingdom Come: Deliverance\"\n6. Instead of click play, scroll down to look for a subsection called \"DLC\"\n7. By now, it should display \"Kingdom Come Deliverance - HD Texture Pack\" - NOT INSTALLED. \n8. Uncheck the box on the left side of that, and check it again. \n9. The download should initiate automatically in steam app download page. \n10. Wait until the download and installation finish. \n11. Go into the game. The HD texture should work in the game now. Enable it from the game menu.\nCheers!"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["2,199"], "funnyCount": ["1,818"], "hoursPlayed": ["55.8"], "postedDate": ["Posted: December 18, 2017"], "content": "I ran a bar as the manager.\nSome guy with a tiny Knuckles avatar and some other guy with a Winnie the Pooh avatar helped me get drinks that were scattered across the map back to the bar.\nTook us around an hour.\nEntire room was cheering because they were too lazy to get the liquor themselves.\nI get more people to like me in VR than in real life."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["708"], "funnyCount": ["12"], "hoursPlayed": ["112.4"], "postedDate": ["Posted: July 13, 2012"], "content": "Mafia brings back good memories of my early childhood. I'd watch my dad play it all the time in '02 and '03 when it first came out around then. This game has an absolute AMAZING storyline and is the greatest 1930's era game I know. Its a bit old, yes I know, but I promise you that you will NOT regret buying it."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["521"], "funnyCount": ["428"], "hoursPlayed": ["31.1"], "postedDate": ["Posted: November 27, 2017"], "content": "Best social anxiety simulator i've played 10/10"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["3,905"], "funnyCount": ["4"], "hoursPlayed": ["178.6"], "postedDate": ["Posted: November 22, 2013"], "content": "Crusader Kings 2 is a complex grand strategy game.  The most complicated game I've ever played. Be prepared to spend hours and I mean hours confused as hell, looking at youtube, the wiki and forums.   Once it clicks though, it's awesome.  Not for everyone, but its kinda like playing through 'real life' Game of Thrones (there's a game of thrones mod too). \nYou control a land owning character starting on any date between 1066 and 1453 AD (The Old Gods DLC will push this starting date back to 867 if you wish).  You can start as a powerful emperor or a lowly count.  The map you play on is more or less Europe stretching into parts of Asia and Africa.  Your sole goal in the game is to keep your bloodline going (and I believe holding land).  Other than that, there isn't a win screen, there aren't defined goals, its open ended, you play until 1453AD and then the game ends (save exportable to Europa Universalis 4 to continue your game with the purchase of a DLC).  You get a 'score', but that is just a rough estimate on how prestigious and pious your bloodline was.  It's quite possible to have 400 years of super rewarding gameplay without getting a high score.  This is a trend you will see me developing on and is a big part of what makes CKII so awesome.\nThat's kinda hard to grasp, but it is less awkward than it sounds.  The goals sort of present themselves naturally.  You don't often sit there with no idea what to do (again, once you understand the game), you kind of always have something you're working towards.  For a first time player this is usually just become as powerful as possible, i.e. aquire land, become a king, then become an emperor and expand your empire.  If you're an advanced player you can set your own crazy goals, roleplay, or do other things to spice up the game.\nThe game runs in 'real time', with a day going by a few times a minute on normal speed.  You can fast forward and pause.  Most of the time you will indeed be going through various menus.  Arranging marriages, keeping tabs on powerful families, plotting assinations, acquiring territory through political shennigans, keeping your subjects happy, bringing in powerful characters to tutor the children of the realm and hold office, and much more.  You can micromanage to your hearts content, play a more hands off style, or switch between the two.\nWhen combat breaks out, it is done by moving stacks of armys around the campaign map, meeting an opposing army will cause a battle.  These really just compose of watching numbers go down, and kills go up, so if you're looking for Total War style combat you arent going to get it here.  Don't be fooled though, many times I've been on the edge of my seat watching these numbers change.  The combat system is quiet nuanced as well. To be the most effective you have many things to consider. Terrain bonuses, attrition penalties, appointing competant commanders from your realm, and more add depth.\nIn all I highly recommend this game to anyone who has played something like Civ or Total War and fancy themself a strategy gamer, is looking for a challenege, and has a lot of patience.  This is kinda the next step you can take into something quite a bit more complicated.  That is the path I took into the game am loving it.\nThe game is still actively having expansions and patches developed for it as of the writing of this review 11/25/2013.\nFull disclosure:  Your reviewer has not quite finished a playthrough yet but am close.  I have 120 hours playtime. I own the dlcs The Old Gods, Legacy of Rome, and the Europa Universalis 4 save converter.  I solely purchased EU4 because of how much I enjoyed my crusader kings 2 game and wanted to continue playing my empire, I haven't even played it yet.\nAlso: Don't buy for full price.  Even though it is worth it, getting the game and all the dlc all at full price is pretty expensive. The base game is often on sale or in bundles.\nThis is my first steam review so if you think this is helpful give the thumbs up and I'll do some more reviews.  Hope you enjoyed reading."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["280"], "funnyCount": ["10"], "hoursPlayed": ["1.6"], "postedDate": ["Posted: March 24, 2018"], "content": "When I was 12 years old, I remember us telling my dad that he should get a bump on his back checked out. At the time the bump was the size of a golf ball or so. My dad ended up getting it checked out and it turned out it was a tumor, we didnt know whether or not it was a benign tumor or not but there was a surgery planned to get it removed. \nThe surgery failed, the tumor was not made out of the material that they thought it was so he had to go to the hospital at a later date to get it fully removed. Once the tumor was removed we found out the the cancer had spread... it was a benign tumor. \nMy dad went through intence radio therapy for two years, our doctor one day told us \"Im really supprised your still walking.\" we asked \"what do you mean?\" and he replied with \"well most of my patients dont make it to every apointment walking, but you seem to always be on your feet walking on your own to every apointment. I can tell your a strong man.\" That suprised most of us that day.\nAbout 2 months after that day the doctor told us that chemo wasn't working but that there was hope of a new treatment in Columbia. So of course my dad got on a plane and flew to Columbia with Canadian merchandise and gifts for the people of Columbia, all he wanted to do was tell them that Canada had a good healthcare system and that if they knew anyone that wanted a better life then they should think about moving to Canada.\nMy dad came back home a week later and found out that the treatment was not working on him. The hospital told him that there was nothing that they could do. I came back from school one day and found a \"death bed\" in my mom and dad's bedroom. I didnt think much of it at the time I just knew he would be happier here at home. \nHe called me into his room one day and he asked me to sit down. He told me some simple words \"You NEED to promise me that you will not stop doing the things that we said we would do after I die. You can still make a cottage, travel the world and build a car together. I know I will not be there for your marriage, or your graduation, i will not see your kids and we will not be able to travel together but you need to go on without me, life goes on... YOU go on.\"\nMy dad was in that \"death bed\" for about a month and a half, everyday a man would come in to help him eat and drink along with other tasks. Every night a woman would come in and help my dad so that my mom could sleep. They dont call it a death bed for nothing, as he got more medicine he got less and less human. His skin turned green, he could not see my face, he could not talk, he could not hear well, he could not move, he was like a doll.\nMy grandmother came from Venezuela to visit my Dad and it was just me,my grandmother and my dad at home. My dad started making wierd noises from his lungs so I called my grandmother to come and we couldnt feel a pulse on his wrist. He was still breathing but his body was trying to survive so blood only traveled to the important organs like the brain and the lungs. We immedietly called everyone including the nurse to come. Everyone was home now except for my older sister who was at a party with her friends, she wasnt answering her phone so I ran to the neighboor's door and pleaded that she drive me to my sister and that my dad was dying, she said yes and we sped there and back. By the time we got back I ran to my dad and held his hand as he went in and out of consciousness until he held his breath... one. last. time. \nI cannot deny that this game brought me right back to that day, because it did and im glad that it did because its an illness that everyone should be aware of. \nRest In Peace,\nAlberto Muller"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["392"], "funnyCount": ["12"], "hoursPlayed": ["5.0"], "postedDate": ["Posted: September 4"], "content": "One of my fondest memories of Spyro was eating a chocolate orange while playing Ripto's Rage during summer. You know, the kind you have to smash on the table to break them into slices? My mom brought it for me and it was pretty damn good.\nTwenty years later, I'm 31 and mom's not here anymore. But Spyro is. And the updated graphics still look how I remember, because our kid imaginations would fill in all the gaps to create a beautiful landscape. And it's pretty damn good. I think I'll go get a chocolate orange and try not to tear up while playing one of the few games that's ever really kept me engaged for an entire summer."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["616"], "funnyCount": ["26"], "hoursPlayed": ["865.1"], "postedDate": ["Posted: December 24, 2018"], "content": "So, here's a simplified list of what you'll find in Terraria: \n- This is a 2D RPG with platformer and sandbox elements\n- It has an incredible amount of content to it\n- Multiple classes that are shaped through armor bonuses (but you can use other items not of your class)\n- Idk like a billion items? Lots of weapons, armor, cosmetics, and building material. It's crazy\n- A good healthy serving of cool and interesting bosses to fight\n- Lots of NPC's to buy stuff from (be ready to build basically a hotel for the like 30 of them in the game now)\n- Really good retro soundtrack but more modern, that fit the creative environments they pair with. Boss fight music gets you pumped! \n- Is it too easy for you? Try Expert mode! Don't feel like you're penalized enough for dying? Set your character to Hardcore!\n- I almost forgot to mention… SO MUCH CRAFTING\nCons? Hmm.\n- Inventory management… the abundance of items will overwhelm you. I usually make a structure dedicated to storing all my loot in chests. Stay organized!\n- Fishing is pretty useful but… well it’s not exactly exciting. You can get some great stuff that way though.\n- Expect a big difficulty spike after defeating the boss in the Underworld! You’ll feel like a noob all over again, but once you work past it is where the game feels like it truly begins for me.\n- Some items in the game are pretty rare and some of these rares are used to craft or otherwise obtain some of the best loot in the game. \nOther thought: \n- If you can play with friends, or find people to run through the game with, do it. It's much more fun that way. You can still enjoy it quite a bit single player, however... it's not the same when you can't laugh when someone gets destroyed by a boulder trap.\nStory time (if you want to torture yourself and read my rambling):\nI bought this game ages ago, back when it was still in development, before any of the expansions and cleanups it's gone through. I spent $10 on this.\nSince then, the Dev team (at least back in 2014-2015 or so when I kept up with it) would post threads about once a month at the least to let people know what was planned/ the progress of the game. It kept getting updated, adding more content and mechanics. I remember being super excited when new weapon types were added, rare mounts were added. Accessories so your character can fly around the map? Gimme. Something I always admire too is Re-Logic did not simply focus on adding more stuff end game, they kept polishing up early game too, adding things like Ropes to make things easier until you get hookshots, simple versions of weapons you find later like Spears, wooden yo-yo, more early game magic items. It used to be a much less enjoyable, slower grind to get to mid game content where the pace picks up.\nThere were at least a couple times where the development with the game was supposedly going to halt, and I was satisfied with it then. I'd gotten more content and enjoyment out of Terraria than most games I'd bought for $30 or more. Yet somehow, maybe a year after hearing nothing, a new content update would surprisingly be pushed out. This happened at least twice, when I thought it would be laid to rest as is. \nI spent $10 on this."}
][
{"recommendedInd": ["Recommended"], "helpfulCount": ["955"], "funnyCount": ["81"], "hoursPlayed": ["28.1"], "postedDate": ["Posted: March 24, 2016"], "content": "As a grand father that has played Machinarium, Botaniucula, Samorost 1 and 2 wtih eight grand kids that love these games I am not disappointed in Samarost 3. I play through the games and then 'read' them on my laptop as 'bed time' stories with the kids. The lack of dialogue encourages the kids to create their own description of the action. It's a treat to listen to them tell what they see as they see it through the eyes of children and not my tired old eyes. \nI have STEAM accounts for all three of the kids families so Iwill be buying this game three more times and it's well worth the money.\nI solved the four- card game to get the jack knife. That clever puzzle will really entertain the kids.\nAmanita Designs is one of my favorite studios so I hope they sell  million copies of this game so I can look forward to their next product. And take your time Amanita as the kids love to go through these games numerous times!\nEven if you don't have grand kids to share this game with GET IT!"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["3,252"], "funnyCount": ["75"], "hoursPlayed": ["0.3"], "postedDate": ["Posted: March 6"], "content": "If you want the original Skyrim game + DLCs,\nSteam and Bethesda keeps it hidden here:\nand the DLCs here:"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["1,225"], "funnyCount": ["190"], "postedDate": ["Posted: March 24, 2015"], "content": "I haven't seen anyone talk about the bone charms themselves, so here goes.\n - \"Enemies miss more often with arrows and bolts.\"\n 0/5. Garbage. The only enemies who use either type of ammunition are the Whalers (Daud's men), and Tallboys. Whalers have abilities that close the gap between you and them, making it unlikely that they'll miss you even with this on, and Tallboys fire volleys of explosive rounds. Neither enemy is one you're going to be taking head on unless you're a more experienced player, and if you are, you're going to be using Blink to dodge and disorient them. Slip this in if you somehow have a free slot, but don't expect much out of this.\n - \"Swim speed increases slightly.\"\n: 1/5. If you're doing a \"Hagfish Possession\" playthrough, it's... mediocre. Otherwise, it's sadly mostly pointless.\n - \"Drop assassination gives you a bit of health.\"\n 5/5. The amount of health restored is somewhat significant. Although this is obviously aimed at High Chaos playstyles, it can be a situational way to regain health when you encounter some of the more \"corrupt\" guards in Low Chaos, or even assassination targets if you get the opportunity to take one out from above. Strong in combination with \n, especially at higher difficulties.\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - \n - \"Powers effects slightly improved.\"\n 5/5. Easily one of the best charms in the game as it makes all of your active powers a little bit better. Just the extra range it gives to Blink is worth slotting this for alone.\n - \"White rats won't attack you.\"\n 0/5. A more accurate description would be \"You take slightly less damage from rat swarms\", which doesn't sound as good (because it isn't). Even if it was the case that a swarm of rats could be comprised of mostly white rats, the brown ones would still attack because their AI is programmed to behave as though they are in a full, hostile swarm, regardless of how many brown rats there are or whether or not the white rats will actually help them attack. Hell, even if this was \"Rat swarms will not attack you\", it would still only be situationally good as rat swarms are not hard to avoid in a game where you can always teleport away (admittedly that would at least have a tangible, considerable effect).\n - \"White rats can be consumed for mana.\"\n 5/5. Works well in combination with Devouring Swarm, allowing you to restore most of the mana you spent on it. This is also a good bone charm for making use of hostile rat swarms, to replenish a little bit of mana and/or to destroy the swarm quicker. Occasionally you'll also find lone white rats scurrying about the place, ripe for the picking. Gutter Feast also makes the Albinos bone charm much more valuable.\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - \n - \"Damage from explosions reduced slightly.\"\n 1/5. The damage reduction is minimal. Some enemies utilize grenades, Tallboys fire explosive arrows, setting off a tripwire will deal explosive damage, and of course you can always flub up your own grenades or whale-oil-hurling shenanigans, but unless you're rampaging through the city, this sort of thing doesn't matter much.\n - \"Win sword-vs-sword contests more frequently.\"\n ?/5. I can't really assess this one, as I'm unable to consistently force the scenario to test it. It probably is good, especially in combination with the Sword Crossing upgrade, but just \n is hard to say. If you're sword fighting your way through the game, you'll probably want this.\n - \"Shot whiskey bottles explode with greater intensity.\"\n 0/5. Garbage. Extremely situational for what seems like no benefit.\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - \n - \"Breaking glass sound is moderately reduced.\"\n 2/5. So rarely do you need to break glass in a stealth playthrough, and when you do, this doesn't prevent enemies that were going to hear you anyway from doing so unless they were already right on that line between \"just in range\" and \"just out of range\". This charm nudges them over to the later, but when enemies are that far away, they're not going to come to investigate regardless of whether or not they hear it, so long as it's only once. Still, occassionally this will work to its full potential and enemies won't hear anything at all, meaning they won't stop or even look in your direction. Better yet, enemies that are so close that they would have automatically come looking for you if they heard it may, instead, only talk aloud about considering to do so, while staying put.\n - \"Breath capacity in water increased slightly.\"\n 2/5. It's roughly 15 seconds longer, which is actually pretty good. Unfortunately, the only reason you'd want to remain underwater that long is if you're \"trapped\", waiting for a guard or something else looking your way to pass by, which is not something that happens too often. But the real problem is that there simply aren't enough areas where a water way is a useful route to take towards an objective, and even when it is, usually you can swim along the surface and not be spotted, or swim underwater and reach such a spot in less than 30 seconds (the default breath capacity). Even in the Flooded District, the area with the most abundant water, this just doesn't do much. Not to mention that, if you're using waterways predominately, you'll probably just pick up Possession and use Hagfish, which have infinite breath capacity anyway. Doing so also avoids the \n of Hagfish, and the primary reason why you don't want to stay underwater very long - namely, that your face tends to get eaten if you do.\n - \"Moderate keyhole peeping magnification.\"\n 0/5. I can't think of anything you need to see through a keyhole that requires additional zoom. Maybe Piero has some ideas.\n- - - - - - - - - - - - - - - - - - - - - - - - - - - -\nAlthough most of these are either undertuned fluff, or just flat out pointless, Gutter Feast, Raven, and Void Channel are well worth getting this DLC for (along with the extra 2000 starting gold, of course)."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["1,045"], "funnyCount": ["513"], "hoursPlayed": ["9.6"], "postedDate": ["Posted: November 6, 2016"], "content": "500 million people have died since Half Life 2 was released. \nMillions of people who will never see Half Life 3.\nHow many more people have to die, Gabe? \nHow many more millions until you do the right thing?"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["514"], "funnyCount": ["8"], "hoursPlayed": ["34.3"], "postedDate": ["Posted: September 10, 2015"], "content": "Want to play DMC3? Get this mod: \nIt is to DMC3SE what DSfix is to Dark Souls. It fixes the performance, controller and sound issues, making the PC version as solid as its console counterparts. \nNot only that, the mod has options for on-the-fly style-switching, weapon-switching for all weapons, Doppelganger and Quicksilver styles for Vergil, Air Hike for every weapon, graphical options, etc. DMC3 now has more moves and twice the number of weapons available at a time than DMC4.\nDevil May Cry 3 is still one of the best action games ever made, and this mod fixes every major issue with the PC port, and elevates the game to even greater heights.\nJust follow these simple steps\n1. Install mod\n2. Follow the instructions.\n3. CURAYZEE\nHappy styling.\nNotes:\nTo make sure the controller works, edit the config .ini file, go to [FIXES], and make sure EnableXInput reads =1\nTo prevent framerate issues, turn off fullscreen in the menu. Then edit the config .ini file, go to [DISPLAY], and change Fullscreen to =1\nIf you have sound or other framerate issues: Edit config .ini file, go to [DEBUG], change DisableBGMEngine to =0 and DisableShadowEngine to =1\nOther mods that add extra moves and options can be found here:\nIf you still have issues getting the controller to work, and installing the StyleSwitcher mod and editing the config file haven't solved your problem, try downloading motioninjoy \n or xpadder.\nIf you haven't found a solution yet, try asking for help here: \nFor anyone using Windows 10 that experiences problems that are not fixed by editing the config file, refer to this guide:\nIf you can't configure your controller in the menu, open Steam on Big Picture Mode. Go to Settings > Controller Settings. Mark \"Generic Gamepad Configuration Support\"."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["718"], "funnyCount": ["16"], "hoursPlayed": ["155.7"], "postedDate": ["Posted: December 29, 2018"], "content": "Quit hiding the original Skyrim from Steam search bar, it needs to be shown as the number one game to find when searching for Skyrim."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["998"], "funnyCount": ["150"], "hoursPlayed": ["112.6"], "postedDate": ["Posted: May 16"], "content": "8 years of free updates and counting\nCheap price of $9.99 and frequent sales\nHundreds of hours of gameplay\nA crap load of customization options\nAmazing mod support\nTold Epic Games to eat a fat one when they tried to buy them out\nHow based can a developer get???"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["2,172"], "funnyCount": ["34"], "hoursPlayed": ["639.3"], "postedDate": ["Posted: December 24, 2018"], "content": "***Important Notice***\nThis game does NOT have Steam cloud support (stupid, I know). All of your character data actually saves in a hidden folder under:\nWindows/User/Username/Appdata(hidden)/Roaming/DarkSoulsIII\nBack up the \"DarkSoulsIII\" file on a usb drive or external.\nI'm posting this in the review section so more people are aware because my solid state crashed while updating (power went out) so I had to reformat the drive and lost all my DS3 data a long time ago. This was about 130 hours into my first character and boy was I furious, it almost turned me off of the game completely *looks at hours played*...Almost. \nPlease mark this as helpful so more people will see. I do not want to anyone lose their progress because of the lack of cloud support."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["1,042"], "funnyCount": ["7"], "hoursPlayed": ["54.7"], "postedDate": ["Posted: January 23"], "content": "An example to all those stuck in Early Access. \nThese developers set realistic goals. Listened to feedback. Gave weekly updates. and released the game in less than a year with MAJOR improvements. They always responded to comments and made the users feel listened too. \nThe game is just excellent in its pollished form. Each character feels unique and each run feels unique. Endless hours of entertainment. But mostly, I'm impressed by the developers work ethics here."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["407"], "funnyCount": ["172"], "hoursPlayed": ["125.4"], "postedDate": ["Posted: November 23, 2017"], "content": "This is the best VR experience I've had and I don't even own a VR headset."}
][
{"recommendedInd": ["Recommended"], "helpfulCount": ["955"], "funnyCount": ["81"], "hoursPlayed": ["28.1"], "postedDate": ["Posted: March 24, 2016"], "content": "As a grand father that has played Machinarium, Botaniucula, Samorost 1 and 2 wtih eight grand kids that love these games I am not disappointed in Samarost 3. I play through the games and then 'read' them on my laptop as 'bed time' stories with the kids. The lack of dialogue encourages the kids to create their own description of the action. It's a treat to listen to them tell what they see as they see it through the eyes of children and not my tired old eyes. \nI have STEAM accounts for all three of the kids families so Iwill be buying this game three more times and it's well worth the money.\nI solved the four- card game to get the jack knife. That clever puzzle will really entertain the kids.\nAmanita Designs is one of my favorite studios so I hope they sell  million copies of this game so I can look forward to their next product. And take your time Amanita as the kids love to go through these games numerous times!\nEven if you don't have grand kids to share this game with GET IT!"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["3,252"], "funnyCount": ["75"], "hoursPlayed": ["0.3"], "postedDate": ["Posted: March 6"], "content": "If you want the original Skyrim game + DLCs,\nSteam and Bethesda keeps it hidden here:\nand the DLCs here:"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["1,225"], "funnyCount": ["190"], "postedDate": ["Posted: March 24, 2015"], "content": "I haven't seen anyone talk about the bone charms themselves, so here goes.\n - \"Enemies miss more often with arrows and bolts.\"\n 0/5. Garbage. The only enemies who use either type of ammunition are the Whalers (Daud's men), and Tallboys. Whalers have abilities that close the gap between you and them, making it unlikely that they'll miss you even with this on, and Tallboys fire volleys of explosive rounds. Neither enemy is one you're going to be taking head on unless you're a more experienced player, and if you are, you're going to be using Blink to dodge and disorient them. Slip this in if you somehow have a free slot, but don't expect much out of this.\n - \"Swim speed increases slightly.\"\n: 1/5. If you're doing a \"Hagfish Possession\" playthrough, it's... mediocre. Otherwise, it's sadly mostly pointless.\n - \"Drop assassination gives you a bit of health.\"\n 5/5. The amount of health restored is somewhat significant. Although this is obviously aimed at High Chaos playstyles, it can be a situational way to regain health when you encounter some of the more \"corrupt\" guards in Low Chaos, or even assassination targets if you get the opportunity to take one out from above. Strong in combination with \n, especially at higher difficulties.\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - \n - \"Powers effects slightly improved.\"\n 5/5. Easily one of the best charms in the game as it makes all of your active powers a little bit better. Just the extra range it gives to Blink is worth slotting this for alone.\n - \"White rats won't attack you.\"\n 0/5. A more accurate description would be \"You take slightly less damage from rat swarms\", which doesn't sound as good (because it isn't). Even if it was the case that a swarm of rats could be comprised of mostly white rats, the brown ones would still attack because their AI is programmed to behave as though they are in a full, hostile swarm, regardless of how many brown rats there are or whether or not the white rats will actually help them attack. Hell, even if this was \"Rat swarms will not attack you\", it would still only be situationally good as rat swarms are not hard to avoid in a game where you can always teleport away (admittedly that would at least have a tangible, considerable effect).\n - \"White rats can be consumed for mana.\"\n 5/5. Works well in combination with Devouring Swarm, allowing you to restore most of the mana you spent on it. This is also a good bone charm for making use of hostile rat swarms, to replenish a little bit of mana and/or to destroy the swarm quicker. Occasionally you'll also find lone white rats scurrying about the place, ripe for the picking. Gutter Feast also makes the Albinos bone charm much more valuable.\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - \n - \"Damage from explosions reduced slightly.\"\n 1/5. The damage reduction is minimal. Some enemies utilize grenades, Tallboys fire explosive arrows, setting off a tripwire will deal explosive damage, and of course you can always flub up your own grenades or whale-oil-hurling shenanigans, but unless you're rampaging through the city, this sort of thing doesn't matter much.\n - \"Win sword-vs-sword contests more frequently.\"\n ?/5. I can't really assess this one, as I'm unable to consistently force the scenario to test it. It probably is good, especially in combination with the Sword Crossing upgrade, but just \n is hard to say. If you're sword fighting your way through the game, you'll probably want this.\n - \"Shot whiskey bottles explode with greater intensity.\"\n 0/5. Garbage. Extremely situational for what seems like no benefit.\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - \n - \"Breaking glass sound is moderately reduced.\"\n 2/5. So rarely do you need to break glass in a stealth playthrough, and when you do, this doesn't prevent enemies that were going to hear you anyway from doing so unless they were already right on that line between \"just in range\" and \"just out of range\". This charm nudges them over to the later, but when enemies are that far away, they're not going to come to investigate regardless of whether or not they hear it, so long as it's only once. Still, occassionally this will work to its full potential and enemies won't hear anything at all, meaning they won't stop or even look in your direction. Better yet, enemies that are so close that they would have automatically come looking for you if they heard it may, instead, only talk aloud about considering to do so, while staying put.\n - \"Breath capacity in water increased slightly.\"\n 2/5. It's roughly 15 seconds longer, which is actually pretty good. Unfortunately, the only reason you'd want to remain underwater that long is if you're \"trapped\", waiting for a guard or something else looking your way to pass by, which is not something that happens too often. But the real problem is that there simply aren't enough areas where a water way is a useful route to take towards an objective, and even when it is, usually you can swim along the surface and not be spotted, or swim underwater and reach such a spot in less than 30 seconds (the default breath capacity). Even in the Flooded District, the area with the most abundant water, this just doesn't do much. Not to mention that, if you're using waterways predominately, you'll probably just pick up Possession and use Hagfish, which have infinite breath capacity anyway. Doing so also avoids the \n of Hagfish, and the primary reason why you don't want to stay underwater very long - namely, that your face tends to get eaten if you do.\n - \"Moderate keyhole peeping magnification.\"\n 0/5. I can't think of anything you need to see through a keyhole that requires additional zoom. Maybe Piero has some ideas.\n- - - - - - - - - - - - - - - - - - - - - - - - - - - -\nAlthough most of these are either undertuned fluff, or just flat out pointless, Gutter Feast, Raven, and Void Channel are well worth getting this DLC for (along with the extra 2000 starting gold, of course)."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["1,045"], "funnyCount": ["513"], "hoursPlayed": ["9.6"], "postedDate": ["Posted: November 6, 2016"], "content": "500 million people have died since Half Life 2 was released. \nMillions of people who will never see Half Life 3.\nHow many more people have to die, Gabe? \nHow many more millions until you do the right thing?"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["514"], "funnyCount": ["8"], "hoursPlayed": ["34.3"], "postedDate": ["Posted: September 10, 2015"], "content": "Want to play DMC3? Get this mod: \nIt is to DMC3SE what DSfix is to Dark Souls. It fixes the performance, controller and sound issues, making the PC version as solid as its console counterparts. \nNot only that, the mod has options for on-the-fly style-switching, weapon-switching for all weapons, Doppelganger and Quicksilver styles for Vergil, Air Hike for every weapon, graphical options, etc. DMC3 now has more moves and twice the number of weapons available at a time than DMC4.\nDevil May Cry 3 is still one of the best action games ever made, and this mod fixes every major issue with the PC port, and elevates the game to even greater heights.\nJust follow these simple steps\n1. Install mod\n2. Follow the instructions.\n3. CURAYZEE\nHappy styling.\nNotes:\nTo make sure the controller works, edit the config .ini file, go to [FIXES], and make sure EnableXInput reads =1\nTo prevent framerate issues, turn off fullscreen in the menu. Then edit the config .ini file, go to [DISPLAY], and change Fullscreen to =1\nIf you have sound or other framerate issues: Edit config .ini file, go to [DEBUG], change DisableBGMEngine to =0 and DisableShadowEngine to =1\nOther mods that add extra moves and options can be found here:\nIf you still have issues getting the controller to work, and installing the StyleSwitcher mod and editing the config file haven't solved your problem, try downloading motioninjoy \n or xpadder.\nIf you haven't found a solution yet, try asking for help here: \nFor anyone using Windows 10 that experiences problems that are not fixed by editing the config file, refer to this guide:\nIf you can't configure your controller in the menu, open Steam on Big Picture Mode. Go to Settings > Controller Settings. Mark \"Generic Gamepad Configuration Support\"."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["718"], "funnyCount": ["16"], "hoursPlayed": ["155.7"], "postedDate": ["Posted: December 29, 2018"], "content": "Quit hiding the original Skyrim from Steam search bar, it needs to be shown as the number one game to find when searching for Skyrim."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["998"], "funnyCount": ["150"], "hoursPlayed": ["112.6"], "postedDate": ["Posted: May 16"], "content": "8 years of free updates and counting\nCheap price of $9.99 and frequent sales\nHundreds of hours of gameplay\nA crap load of customization options\nAmazing mod support\nTold Epic Games to eat a fat one when they tried to buy them out\nHow based can a developer get???"},
{"recommendedInd": ["Recommended"], "helpfulCount": ["2,172"], "funnyCount": ["34"], "hoursPlayed": ["639.3"], "postedDate": ["Posted: December 24, 2018"], "content": "***Important Notice***\nThis game does NOT have Steam cloud support (stupid, I know). All of your character data actually saves in a hidden folder under:\nWindows/User/Username/Appdata(hidden)/Roaming/DarkSoulsIII\nBack up the \"DarkSoulsIII\" file on a usb drive or external.\nI'm posting this in the review section so more people are aware because my solid state crashed while updating (power went out) so I had to reformat the drive and lost all my DS3 data a long time ago. This was about 130 hours into my first character and boy was I furious, it almost turned me off of the game completely *looks at hours played*...Almost. \nPlease mark this as helpful so more people will see. I do not want to anyone lose their progress because of the lack of cloud support."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["1,042"], "funnyCount": ["7"], "hoursPlayed": ["54.7"], "postedDate": ["Posted: January 23"], "content": "An example to all those stuck in Early Access. \nThese developers set realistic goals. Listened to feedback. Gave weekly updates. and released the game in less than a year with MAJOR improvements. They always responded to comments and made the users feel listened too. \nThe game is just excellent in its pollished form. Each character feels unique and each run feels unique. Endless hours of entertainment. But mostly, I'm impressed by the developers work ethics here."},
{"recommendedInd": ["Recommended"], "helpfulCount": ["407"], "funnyCount": ["172"], "hoursPlayed": ["125.4"], "postedDate": ["Posted: November 23, 2017"], "content": "This is the best VR experience I've had and I don't even own a VR headset."}
][
{"recommendedInd": ["Not Recommended"], "helpfulCount": ["4,173"], "funnyCount": ["571"], "hoursPlayed": ["223.1"], "postedDate": ["Posted: June 20, 2018"], "content": "Money-making machine. More skins, more lootboxes, less bugfixes and optimization. Screw you guys, i'm going home."},
{"recommendedInd": ["Not Recommended"], "helpfulCount": ["6,453"], "funnyCount": ["291"], "hoursPlayed": ["407.3"], "postedDate": ["Posted: May 29, 2018"], "content": "I've encountered this game just like 99,9% of it's player-base did, by watching Twitch streams and youtube videos.\nBeing something relatively new in the multiplayer scene (THAT ACTUALLY HAD A MASSIVE PLAYER-BASE), I managed to talk few of my friends into playing it.\nI'm not going to lie, we've spent hundreds of hours on it.\nThat was until the official release of 1.0\nKeep in mind that we're talking about previously most played game in the world at some point, a game which brought it's developers millions (if not 10 digit numbers), and as any sane person, you'd expect that it will be poured into further development and fixes, right?\nLOL wrong. We're talking about Bluehole here.\nYou really have to be next level special in order to stumble upon a gold mine, and then proceed to blow it up and cave it in. They had everything, massive FREE ADVERTISEMENT (NOTE: FREE > NOT REQUIRED TO PAY FOR) in a form of Twitch streamers and YouTube content creators, insane ACTIVE player-base, a product that's close to being 1.0 ready... Everything.\nThey got money, they got everything. And what do they do?:\n \nIn game purchases.\nIt's disgusting seeing that someone who had all the foundation required to make a masterpiece ignore all that and just attempts to drain more money from players.\nThey rushed the 1.0 to be able to implement in-game purchases, and instead of actually WORKING on it, what do they do? More platforms.\nNot only that none of the platforms performed remotely well, they completely ignored that fact and started working on more crates and more in-game purchases.\nSince I could go about this all day long, and considering I'm actually rating a game here and not it's thirsty developer, I'll focus on it now:\nPros:\n- Fast queue times due to high player-base,\n- SOLID graphics.\n- Good ballistics (Sniper and AR bullet drop)\nCons:\n- Fully released game some of the problems that should have been fixed before the release.\nEDIT:\n- PLENTY OF CHEATERS. Even though the developers started to take action against hackers now that the game has headed to ruin, there are still PLENTY of non-conventional cheaters such as VPN abusers (lifting ping on purpose to abuse the poor netcode and hit detection) and Macro users (Auto-aim/Recoil control). Even though the numbers have dropped, this is still heavily affecting the game and user experience.\n- Countless game breaking bugs (getting killed by nothing when vaulting, getting stuck in thin air while landing resulting in getting killed, reloading sometimes doesn't reload your weapon at all resulting in getting killed...)\n- HORRIBLE performance issues (High end PC users can be happy if they hit constant 60fps on medium-high settings at all times)\n- Hilarous netcode. So many instances when you get killed by someone who didn't even have a line of sight, constant stuttering, 60%+ fail rate of reconnecting to the game in case of a disconnect.\n- Horrible bullet detection system (this one mostly affects Shotguns)\n- ♥♥♥♥♥♥♥♥ level design. This one is a great issue mostly focused on the Miramar map. They forced a new map which is massive in terms of size, but ironically has least content, least quality looting area, a MASSIVE LACK of vehicles considering the proportions of the map (mostly resulting in you playing a running simulator for about 20 minutes and ending up getting killed by someone who had luck with the initial safe zone). Even though the original map is better, they still need to prevent bridge camping which makes the game impossible if you had bad luck with initial looting and safe zone.\n- EDIT: Since one of the recent patches, my character no longer stutters while running, proving my point this was indeed caused by the game, and not by my PC or internet connection.\n- I will stop with Cons for now since there's only so much time I can waste on this review. But yes, there are way more.\n################\nBottom line, if you haven't already bought this game: DO NOT. Save your money. There are better alternatives if you're just taking up a new game, and they're even free to play. They don't have some of the mechanics PUBG has, and that's a shame, but at least they're optimized. Keep in mind that this game requires over the average PC to even be able to start the game, let alone play it properly.\nThis is not a dead game yet, there's still time to fix it."},
{"recommendedInd": ["Not Recommended"], "helpfulCount": ["104"], "funnyCount": ["2"], "hoursPlayed": ["274.1"], "postedDate": ["Posted: December 28, 2017"], "content": "Pubg is one of the best shooters ive played so far this year and with the hours Ive put in I can not recommend this game in the current state. Ive had 18 Chicken Dinners but something needs to be done with the Chinese/Korean players. Ive encountered many hackers ever since the game came out of early access.Clean out the hackers and make people play in their own regions and youll have a hit. Let the hackers play with the hackers."},
{"recommendedInd": ["Not Recommended"], "helpfulCount": ["1,712"], "funnyCount": ["261"], "hoursPlayed": ["181.7"], "postedDate": ["Posted: January 28, 2018"], "content": "HIGH PING CHEATERS \n▒█▀▀█ ▒█▀▀▀ ▒█▀▀█ ▀█▀ ▒█▀▀▀█ ▒█▄░▒█\n▒█▄▄▀ ▒█▀▀▀ ▒█░▄▄ ▒█░ ▒█░░▒█ ▒█▒█▒█\n▒█░▒█ ▒█▄▄▄ ▒█▄▄█ ▄█▄ ▒█▄▄▄█ ▒█░░▀█\n▒█░░░ ▒█▀▀▀█ ▒█▀▀█ ▒█░▄▀\n▒█░░░ ▒█░░▒█ ▒█░░░ ▒█▀▄░\n▒█▄▄█ ▒█▄▄▄█ ▒█▄▄█ ▒█░▒█\n▒█▀▀█ ▒█░▒█ ▀█▀ ▒█▄░▒█ ░█▀▀█\n▒█░░░ ▒█▀▀█ ▒█░ ▒█▒█▒█ ▒█▄▄█\n▒█▄▄█ ▒█░▒█ ▄█▄ ▒█░░▀█ ▒█░▒█"},
{"recommendedInd": ["Not Recommended"], "helpfulCount": ["1,100"], "funnyCount": ["57"], "hoursPlayed": ["67.7"], "postedDate": ["Posted: January 7, 2018"], "content": "#Regionlockchina"},
{"recommendedInd": ["Not Recommended"], "helpfulCount": ["122"], "funnyCount": ["6"], "hoursPlayed": ["745.6"], "postedDate": ["Posted: January 7, 2018"], "content": "This game was soo fun at the start getting our first Chicken Dinner was amazing until patch 1.0 came out though almost every round we play we loot find good stuff fast and kill a few at the start.\nThen late game die to a hacker who will shoot through two buildings with a SKS with a 8x scope full autoing headshot it's a load of garbage don't buy this game anymore until they fix the major hacking problem they have within it."},
{"recommendedInd": ["Not Recommended"], "helpfulCount": ["1,442"], "funnyCount": ["238"], "hoursPlayed": ["370.8"], "postedDate": ["Posted: February 3, 2018"], "content": "In my nearly 300 hours (at the time of writing this) I have experienced:\n- People who can shoot me around corners due to ping\n- People who form a team of 8 in solos and proceed to gang bang anyone else\n- People who can instantly lock on to me and shoot the wall im behind with no recoil\n- People who can shoot through the wall im behind\n- People who can shoot directly at the ground 4 km away from where I am and kill me\n- People who can fire a Shotgun like an Assault rifle despite not having a AR equiped \n- People who can turn cars invisible so when im driving my motorbike across the military bridge I slam into a invisible car, blow up, and then the car materialises\nAnd if you say none of these people listed above were chinese. \nI'm sorry.\nBut you are deluded \nRegion Lock China"},
{"recommendedInd": ["Not Recommended"], "helpfulCount": ["5,252"], "funnyCount": ["161"], "hoursPlayed": ["105.4"], "postedDate": ["Posted: December 29, 2017"], "content": "Region lock please"},
{"recommendedInd": ["Not Recommended"], "helpfulCount": ["140"], "funnyCount": ["8"], "hoursPlayed": ["299.2"], "postedDate": ["Posted: January 25, 2018"], "content": "Cheaters everywhere. Buy it when you want to get killed by someone aiming at the ground while you are 500m away in a House. And the worst thing about it is that a lot of the people use an ESP Hack or Wallhack. Also the damn No Recoil crap."},
{"recommendedInd": ["Not Recommended"], "helpfulCount": ["1,400"], "funnyCount": ["126"], "hoursPlayed": ["175.5"], "postedDate": ["Posted: January 19, 2018"], "content": "Region lock china"}
]